import streamlit as st

# ส่วนหัวข้อเว็บ (header)
st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน")
st.write("นี่คือเว็ปแอปพลิเคชั่นแรกของผม เขียนด้วยภาษาpythonครับ")

st.divider() # เส้นคั่นแบ่งสัดส่วนให้สวยงาม

# ข้อมูลโปรไฟล์ส่วนตัว (profile info)
st.header("ข้อมูลส่วนตัว")
st.write("**ชื่อนามสกุล:**นายตฤนภัทร แสงปรีดานนท์")
st.write("**ชั้น ม.4/2** เลขที่ 39")
st.write("**โรงเรียน:** ยุพราชวิทยาลัย")

# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกกับความรู้สึกการเขียนเว็บครั้งแรก"):
  st.success(f"ว้าว! สนุกและง่ายกว่าที่คิดมากๆ")
